src/DataProcessors/ПереносРеализацийВ1С7/ПереносРеализацийВ1С7.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПереносРеализацийВ1С7</name>
  <attributes>
    <name>ИмяПользователя</name>
    <comment>Имя пользователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <comment>Пароль</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменДанными</name>
    <type>
      <types>CatalogRef.ОбменДанными</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Documents/Реализация/Реализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Реализация</name>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ПоступлениеМПЗ</basedOn>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.Долги</registerRecords>
  <registerRecords>AccumulationRegister.ЗаявкиОтПокупателей</registerRecords>
  <attributes>
    <name>Внутренняя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэфф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерУПД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПолучатель</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьГТД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидТовара</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Материалы/Материалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Материалы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PartNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатериала</name>
    <type>
      <types>CatalogRef.ВидыМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Возвратный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВариабельности</name>
    <type>
      <types>EnumRef.ГруппыВариабельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоЗакупкам</name>
    <type>
      <types>EnumRef.ГруппыПоЗакупкам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИВХ</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаХранения</name>
    <type>
      <types>EnumRef.ЗоныХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторВнесения</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталогизатор</name>
    <type>
      <types>CatalogRef.Каталогизатор</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКЗаказу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьГрупповойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьЗаготовки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьИндивидуальнойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Критичный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоЗакупкам</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МинОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеSMD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативРабочейЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМодели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПиковыеПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <comment>Полное наименование, краткие характеристики</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакНеделимойУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВнесения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрослеживаемыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделПоЕСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНормированияЗакупок</name>
    <type>
      <types>EnumRef.ТипыНормированияЗакупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоставки</name>
    <type>
      <types>EnumRef.ТипыПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРиска</name>
    <type>
      <types>EnumRef.ТипыРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходнойКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаФактическаяНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтационарныеПитатели</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Замены</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщики</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КоммерческиеПредложения</name>
    <attributes>
      <name>КП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБыло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСтало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ПереносРеализацийВ1С7/Forms/Форма/Module.bsl
&НаСервере
Функция ПолучитьСписокРеализаций()
СписокРеализаций = Новый СписокЗначений;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реализация.Ссылка
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И Реализация.Проведен = ИСТИНА
	|	И Реализация.Контрагент = &Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Реализация.Номер";
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Объект.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Объект.Период.ДатаОкончания));
Запрос.УстановитьПараметр("Контрагент", Контрагент);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокРеализаций.Добавить(ВыборкаДетальныеЗаписи.Ссылка,ВыборкаДетальныеЗаписи.Ссылка.Номер);
	КонецЦикла;
Возврат(СписокРеализаций);
КонецФункции

&НаСервере
Функция ПолучитьДатуРеализации(Док)
Возврат(Док.Дата);
КонецФункции

&НаСервере
Функция ПолучитьКомментарийРеализации(Док)
Возврат(Док.Комментарий);
КонецФункции

&НаСервере
Функция ЗаполненДокументОснование(Док)
Возврат(ЗначениеЗаполнено(Док.ДокументОснование));
КонецФункции

&НаСервере
Функция ПолучитьНомерДокументаОснования(Док)
Возврат(Док.ДокументОснование.Номер);
КонецФункции

&НаСервере
Функция ПолучитьДатуДокументаОснования(Док)
Возврат(Док.ДокументОснование.Дата);
КонецФункции

&НаСервере
Функция ПолучитьМестоХраненияРеализации(Док)
Возврат(Док.МестоХранения);
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуМПЗ(Док)
ТаблицаМПЗ.Очистить();
	Для каждого ТЧ Из Док.ТабличнаяЧасть Цикл
	ТЧ_МПЗ = ТаблицаМПЗ.Добавить();
		Если ТЧ.ВидТовара = Перечисления.ВидыМПЗ.Материалы Тогда	
		ТЧ_МПЗ.ВидМПЗ = 1;
		ТЧ_МПЗ.МПЗ = СокрЛП(ТЧ.Товар.Наименование);
		Иначе 
		ТЧ_МПЗ.ВидМПЗ = 2;
			Если Док.МестоХранения = МестоХраненияДляСозданияМатериалов Тогда
				Если ТЧ.Товар.Товар.Пустая() Тогда
				ТЧ_МПЗ.МПЗ = СокрЛП(глНаименованиеВСкобкахБезЭтапа(ТЧ.Товар.Наименование));
				Иначе	
				ТЧ_МПЗ.МПЗ = СокрЛП(ТЧ.Товар.Товар.Наименование);
				КонецЕсли;	
			Иначе	
			ТЧ_МПЗ.МПЗ = СокрЛП(ТЧ.Товар.Наименование);
			КонецЕсли;
		КонецЕсли;
	ТЧ_МПЗ.Количество = ТЧ.Количество;
	ТЧ_МПЗ.ЕдиницаИзмерения = СокрЛП(ТЧ.ЕдиницаИзмерения.Наименование);
	ТЧ_МПЗ.Цена = ТЧ.Цена;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеТоваров(V7,Проверить,Реализация,РеализацияНомер)
БСДДокОсн = V7.CreateObject("Документ.Заказ");	
БСДДок = V7.CreateObject("Документ.ПоступлениеТоваров");
БСДМат = V7.CreateObject("Справочник.Материалы");
БСДНом = V7.CreateObject("Справочник.Номенклатура");
ЕдИзмМат = V7.CreateObject("Справочник.ЕдиницыМатериалов");
ЕдИзмНом = V7.CreateObject("Справочник.ЕдиницыНоменклатуры");
СпрЕИ = V7.CreateObject("Справочник.ЕдиницыНоменклатуры");
СпрЕИМат = V7.CreateObject("Справочник.ЕдиницыМатериалов");
ВидНом = V7.CreateObject("Справочник.ВидыНоменклатуры");

РеализацияДата = ПолучитьДатуРеализации(Реализация);
МестоХранения = ПолучитьМестоХраненияРеализации(Реализация);

БСДДок.ВыбратьДокументы();
	Пока БСДДок.ПолучитьДокумент() = 1 Цикл
		Если СокрЛП(БСДДок.НомерДокВходящий) = СокрЛП(РеализацияНомер) Тогда
		Сообщить("Реализация №"+РеализацияНомер+" уже перенесён в Харьковскую базу.");
		Возврат;
		КонецЕсли;	
	КонецЦикла;
БСДДок.Новый();
	Если ИспользоватьРучнуюНумерацию Тогда
	БСДДок.НомерДок = Прав(Год(РеализацияДата),2)+"-"+Формат(ТекНомерП,"ЧЦ=4; ЧВН=; ЧГ=0");
	ТекНомерП = ТекНомерП + 1;
	Иначе
	БСДДок.УстановитьНовыйНомер(Прав(Год(РеализацияДата),2)+"-");	
	КонецЕсли; 
БСДДок.ДатаДок = РеализацияДата;	                      
БСДДок.НомерДокВходящий = РеализацияНомер;
БСДДок.ДатаДокВходящий = РеализацияДата;
БСДДок.Курс = 0.2;
БСДДок.ВариантРасчетаНалогов = V7.Константа.ОсновнойВариантРасчетаНалогов;
БСДДок.Комментарий = ПолучитьКомментарийРеализации(Реализация);
ЗаполнитьТаблицуМПЗ(Реализация);              
	Для каждого ТЧ Из ТаблицаМПЗ Цикл
		Если ТЧ.ВидМПЗ = 1 Тогда
			Если БСДМат.НайтиПоНаименованию(ТЧ.МПЗ,0,1) = 1 Тогда
			БСДДок.НоваяСтрока();
			БСДДок.ВидМПЗ = V7.Перечисление.ВидыМПЗ.Материалы;  
			БСДДок.Товар = БСДМат.ТекущийЭлемент();                
			БСДДок.Количество = ТЧ.Количество;                                 
			БСДДок.ЦенаВал = ТЧ.Цена;					
			ЕдИзмМат.ИспользоватьВладельца(БСДМат.ТекущийЭлемент());
				Если ЕдИзмМат.НайтиПоНаименованию(ТЧ.ЕдиницаИзмерения,1,1) = 1 Тогда
				БСДДок.ЕдиницаИзмерения = ЕдИзмМат.ТекущийЭлемент();						
				КонецЕсли;				
			Иначе
			Сообщить("Материал "+ТЧ.МПЗ+" - не найден в базе 1С7.7!");	
			КонецЕсли;
		Иначе
			Если МестоХранения = МестоХраненияДляСозданияМатериалов Тогда
				Если БСДМат.НайтиПоНаименованию(ТЧ.МПЗ,0,1) = 1 Тогда
				БСДДок.НоваяСтрока();
				БСДДок.ВидМПЗ = V7.Перечисление.ВидыМПЗ.Материалы; 
				БСДДок.Товар = БСДМат.ТекущийЭлемент();                
				БСДДок.Количество = ТЧ.Количество;                                 
				БСДДок.ЦенаВал = ТЧ.Цена;					
				ЕдИзмМат.ИспользоватьВладельца(БСДМат.ТекущийЭлемент());
					Если ЕдИзмМат.НайтиПоНаименованию(ТЧ.ЕдиницаИзмерения,1,1) = 1 Тогда
					БСДДок.ЕдиницаИзмерения = ЕдИзмМат.ТекущийЭлемент();						
					КонецЕсли;				
				Иначе
					Если СоздатьНедостающиеПолуфабрикаты Тогда
					БСДМат.НайтиПоНаименованию("Изделия для перепродажи",0,1);
					ТекГруппа = БСДМат.ТекущийЭлемент();
					БСДМат.ИспользоватьРодителя(ТекГруппа.ТекущийЭлемент());
					БСДМат.Новый();
					БСДМат.Родитель = ТекГруппа.ТекущийЭлемент();
					БСДМат.Код = СледующийКод;
					БСДМат.Наименование = ТЧ.МПЗ;
					БСДМат.ПолнНаименование = ТЧ.МПЗ;
					БСДМат.ЕдиницаИзмерения = V7.глЗначениеПоУмолчанию("ОсновнаяЕдиницаИзмерения");
					Сч = "10.1";			
					БСДМат.Субсчет = V7.EvalExpr("СчетПоКоду("+Сч+")");
					БСДМат.Записать();                                         
					БСДМат.СтавкаНДС.Установить(ТекущаяДата(),V7.глЗначениеПоУмолчанию("ОсновнаяСтавкаНДС"));
					БСДМат.СтавкаНП.Установить(ТекущаяДата(),V7.глЗначениеПоУмолчанию("ОсновнаяСтавкаНП"));			
					СпрЕИМат.ИспользоватьВладельца(БСДМат.ТекущийЭлемент());
					СпрЕИМат.Новый();
					СпрЕИМат.ЕдиницаИзмерения = БСДМат.ЕдиницаИзмерения;
					СпрЕИМат.Коэффициент = 1;
					СпрЕИМат.Наименование = БСДМат.ЕдиницаИзмерения.Наименование;
					СпрЕИМат.Записать();
					БСДМат.ОсновнаяЕдиницаИзмерения = СпрЕИМат.ТекущийЭлемент();  
					БСДМат.Записать();	                                       
					Сообщить("Материал "+ТЧ.МПЗ+" - создан в базе 1С7.7!");
					СледующийКод = СледующийКод + 1;									
					Иначе	
					Сообщить("Полуфабрикат "+ТЧ.МПЗ+" - не найден в базе 1С7.7!");
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если БСДНом.НайтиПоНаименованию(ТЧ.МПЗ,0,1) = 1 Тогда
				БСДДок.НоваяСтрока();
				БСДДок.ВидМПЗ = V7.Перечисление.ВидыМПЗ.Полуфабрикаты; 
				БСДДок.Товар = БСДНом.ТекущийЭлемент();                
				БСДДок.Количество = ТЧ.Количество;                                 
				БСДДок.ЦенаВал = ТЧ.Цена;					
				ЕдИзмНом.ИспользоватьВладельца(БСДНом.ТекущийЭлемент());
					Если ЕдИзмНом.НайтиПоНаименованию(ТЧ.ЕдиницаИзмерения,1,1) = 1 Тогда
					БСДДок.ЕдиницаИзмерения = ЕдИзмНом.ТекущийЭлемент();						
					КонецЕсли;				
				Иначе
					Если СоздатьНедостающиеПолуфабрикаты Тогда	
					ВидНом.НайтиПоНаименованию("Полуфабрикат",0,1);
					БСДНом.НайтиПоНаименованию("Товары для перепродажи",0,1);
					ТекГруппа = БСДНом.ТекущийЭлемент();
					БСДНом.Новый();
					БСДНом.Родитель = ТекГруппа.ТекущийЭлемент();
					БСДНом.Наименование = ТЧ.МПЗ;
					БСДНом.ПолнНаименование = ТЧ.МПЗ;
					БСДНом.Валюта = V7.глЗначениеПоУмолчанию("ОсновнаяВалюта");
					БСДНом.ВидНоменклатуры = ВидНом.ТекущийЭлемент();	
					БСДНом.ТипНоменклатуры = ВидНом.ТипНоменклатуры;
					БСДНом.ЕдиницаИзмерения = V7.глЗначениеПоУмолчанию("ОсновнаяЕдиницаИзмерения");			
					БСДНом.Записать();                                         
					БСДНом.СтавкаНДС.Установить(ТекущаяДата(),V7.глЗначениеПоУмолчанию("ОсновнаяСтавкаНДС"));
					БСДНом.СтавкаНП.Установить(ТекущаяДата(),V7.глЗначениеПоУмолчанию("ОсновнаяСтавкаНП"));			
					СпрЕИ.ИспользоватьВладельца(БСДНом.ТекущийЭлемент());
					СпрЕИ.Новый();
					СпрЕИ.ЕдиницаИзмерения = БСДНом.ЕдиницаИзмерения;
					СпрЕИ.Коэффициент = 1;
					СпрЕИ.Наименование = БСДНом.ЕдиницаИзмерения.Наименование;
					СпрЕИ.Записать();
					БСДНом.ОсновнаяЕдиницаИзмерения = СпрЕИ.ТекущийЭлемент();  
					БСДНом.Записать();	                                       
					Сообщить("Полуфабрикат "+ТЧ.МПЗ+" - создан в базе 1С7.7!");								
					Иначе	
					Сообщить("Полуфабрикат "+ТЧ.МПЗ+" - не найден в базе 1С7.7!");
					КонецЕсли; 
				КонецЕсли;	
			КонецЕсли;		
		КонецЕсли; 		
	КонецЦикла;
		Если Не Проверить Тогда
			Если БСДДок.КоличествоСтрок() > 0 Тогда
				Если ЗаполненДокументОснование(Реализация) Тогда
				БСДДокОсн.НайтиПоНомеру(ПолучитьНомерДокументаОснования(Реализация),ПолучитьДатуДокументаОснования(Реализация));
				БСДДок.ДокументОснование = БСДДокОсн.ТекущийДокумент();
				КонецЕсли;                         
			БСДДок.Записать();
			Сообщить("Реализация материалов №"+РеализацияНомер+" перенесён в Поступление МПЗ №"+СокрЛП(БСДДок.НомерДок));
			Иначе
			Сообщить("Реализация материалов №"+РеализацияНомер+" не перенесён из-за отсутствия элементов в базе.");
			КонецЕсли; 				
		КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Соединиться(Команда,Проверить = Ложь)
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
	Возврат;
	КонецЕсли; 
НастройкиОбменаДанными = ОбщийМодульСинхронизации.ПолучитьНастройкиОбменаДанными(Объект.ОбменДанными);
V7 = ОбщийМодульКлиент.ПодключитьсяК1С77(НастройкиОбменаДанными.ПутьКБазеДанных,Объект.ИмяПользователя,Объект.Пароль);
	Если V7 = Неопределено Тогда
	Возврат;	
	КонецЕсли;
Состояние("Обработка...",,"Получение списка документов Реализация...");
СписокРеализаций = ПолучитьСписокРеализаций();
	Если Проверить Тогда
	стрДействие = "Проверка";
	Иначе
	стрДействие = "Выгрузка";
	КонецЕсли; 
к = 1;
	Для каждого Реализация Из СписокРеализаций Цикл	
	Состояние("Обработка...",к*100/СписокРеализаций.Количество(),стрДействие+" реализации "+Реализация.Представление+"...");
	ПоступлениеТоваров(V7,Проверить,Реализация.Значение,Реализация.Представление);
	к = к + 1;
	КонецЦикла;  
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
Соединиться(Неопределено,Истина);
КонецПроцедуры
